seung-gu/stm32_board_practice/include/memory_map_stm32f411xe.h
#define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)	 

/** 
  *  Inter-integrated Circuit Interface
  */

typedef struct
{
  volatile uint32_t CR1;        /*!< I2C Control register 1,     Address offset: 0x00 */
  volatile uint32_t CR2;        /*!< I2C Control register 2,     Address offset: 0x04 */
  volatile uint32_t OAR1;       /*!< I2C Own address register 1, Address offset: 0x08 */
  volatile uint32_t OAR2;       /*!< I2C Own address register 2, Address offset: 0x0C */
  volatile uint32_t DR;         /*!< I2C Data register,          Address offset: 0x10 */
  volatile uint32_t SR1;        /*!< I2C Status register 1,      Address offset: 0x14 */
  volatile uint32_t SR2;        /*!< I2C Status register 2,      Address offset: 0x18 */
  volatile uint32_t CCR;        /*!< I2C Clock control register, Address offset: 0x1C */
  volatile uint32_t TRISE;      /*!< I2C TRISE register,         Address offset: 0x20 */
  volatile uint32_t FLTR;       /*!< I2C FLTR register,          Address offset: 0x24 */
} I2C_TypeDef;
	 
#define I2C1                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                ((I2C_TypeDef *) I2C3_BASE)	 

/** 
  *  Independent WATCHDOG
  */

typedef struct
{
  volatile uint32_t KR;   /*!< IWDG Key register,       Address offset: 0x00 */
  volatile uint32_t PR;   /*!< IWDG Prescaler register, Address offset: 0x04 */
  volatile uint32_t RLR;  /*!< IWDG Reload register,    Address offset: 0x08 */
  volatile uint32_t SR;   /*!< IWDG Status register,    Address offset: 0x0C */
} IWDG_TypeDef;

#define IWDG                ((IWDG_TypeDef *) IWDG_BASE)

/** 
  *  Power Control
  */

typedef struct
{
  volatile uint32_t CR;   /*!< PWR power control register,        Address offset: 0x00 */
  volatile uint32_t CSR;  /*!< PWR power control/status register, Address offset: 0x04 */
} PWR_TypeDef;
	 
#define PWR                 ((PWR_TypeDef *) PWR_BASE)	 

/** 
  *  Reset and Clock Control
  */

typedef struct
{
  volatile uint32_t CR;            /*!< RCC clock control register,                                  Address offset: 0x00 */
  volatile uint32_t PLLCFGR;       /*!< RCC PLL configuration register,                              Address offset: 0x04 */
  volatile uint32_t CFGR;          /*!< RCC clock configuration register,                            Address offset: 0x08 */
  volatile uint32_t CIR;           /*!< RCC clock interrupt register,                                Address offset: 0x0C */
  volatile uint32_t AHB1RSTR;      /*!< RCC AHB1 peripheral reset register,                          Address offset: 0x10 */
  volatile uint32_t AHB2RSTR;      /*!< RCC AHB2 peripheral reset register,                          Address offset: 0x14 */
  volatile uint32_t AHB3RSTR;      /*!< RCC AHB3 peripheral reset register,                          Address offset: 0x18 */
  uint32_t      RESERVED0;     /*!< Reserved, 0x1C                                                                    */
  volatile uint32_t APB1RSTR;      /*!< RCC APB1 peripheral reset register,                          Address offset: 0x20 */
  volatile uint32_t APB2RSTR;      /*!< RCC APB2 peripheral reset register,                          Address offset: 0x24 */
  uint32_t      RESERVED1[2];  /*!< Reserved, 0x28-0x2C                                                               */
  volatile uint32_t AHB1ENR;       /*!< RCC AHB1 peripheral clock register,                          Address offset: 0x30 */
  volatile uint32_t AHB2ENR;       /*!< RCC AHB2 peripheral clock register,                          Address offset: 0x34 */
  volatile uint32_t AHB3ENR;       /*!< RCC AHB3 peripheral clock register,                          Address offset: 0x38 */
  uint32_t      RESERVED2;     /*!< Reserved, 0x3C                                                                    */
  volatile uint32_t APB1ENR;       /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x40 */
  volatile uint32_t APB2ENR;       /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x44 */
  uint32_t      RESERVED3[2];  /*!< Reserved, 0x48-0x4C                                                               */
  volatile uint32_t AHB1LPENR;     /*!< RCC AHB1 peripheral clock enable in low power mode register, Address offset: 0x50 */
  volatile uint32_t AHB2LPENR;     /*!< RCC AHB2 peripheral clock enable in low power mode register, Address offset: 0x54 */
  volatile uint32_t AHB3LPENR;     /*!< RCC AHB3 peripheral clock enable in low power mode register, Address offset: 0x58 */
  uint32_t      RESERVED4;     /*!< Reserved, 0x5C                                                                    */
  volatile uint32_t APB1LPENR;     /*!< RCC APB1 peripheral clock enable in low power mode register, Address offset: 0x60 */
  volatile uint32_t APB2LPENR;     /*!< RCC APB2 peripheral clock enable in low power mode register, Address offset: 0x64 */
  uint32_t      RESERVED5[2];  /*!< Reserved, 0x68-0x6C                                                               */
  volatile uint32_t BDCR;          /*!< RCC Backup domain control register,                          Address offset: 0x70 */
  volatile uint32_t CSR;           /*!< RCC clock control & status register,                         Address offset: 0x74 */
  uint32_t      RESERVED6[2];  /*!< Reserved, 0x78-0x7C                                                               */
  volatile uint32_t SSCGR;         /*!< RCC spread spectrum clock generation register,               Address offset: 0x80 */
  volatile uint32_t PLLI2SCFGR;    /*!< RCC PLLI2S configuration register,                           Address offset: 0x84 */
  uint32_t      RESERVED7[1];  /*!< Reserved, 0x88                                                                    */
  volatile uint32_t DCKCFGR;       /*!< RCC Dedicated Clocks configuration register,                 Address offset: 0x8C */
} RCC_TypeDef;
	 
#define RCC                 ((RCC_TypeDef *) RCC_BASE)	 

/** 
  *  Real-Time Clock
  */

typedef struct
{
  volatile uint32_t TR;      /*!< RTC time register,                                        Address offset: 0x00 */
  volatile uint32_t DR;      /*!< RTC date register,                                        Address offset: 0x04 */
  volatile uint32_t CR;      /*!< RTC control register,                                     Address offset: 0x08 */
  volatile uint32_t ISR;     /*!< RTC initialization and status register,                   Address offset: 0x0C */
  volatile uint32_t PRER;    /*!< RTC prescaler register,                                   Address offset: 0x10 */
  volatile uint32_t WUTR;    /*!< RTC wakeup timer register,                                Address offset: 0x14 */
  volatile uint32_t CALIBR;  /*!< RTC calibration register,                                 Address offset: 0x18 */
  volatile uint32_t ALRMAR;  /*!< RTC alarm A register,                                     Address offset: 0x1C */
  volatile uint32_t ALRMBR;  /*!< RTC alarm B register,                                     Address offset: 0x20 */
  volatile uint32_t WPR;     /*!< RTC write protection register,                            Address offset: 0x24 */
  volatile uint32_t SSR;     /*!< RTC sub second register,                                  Address offset: 0x28 */
  volatile uint32_t SHIFTR;  /*!< RTC shift control register,                               Address offset: 0x2C */
  volatile uint32_t TSTR;    /*!< RTC time stamp time register,                             Address offset: 0x30 */
  volatile uint32_t TSDR;    /*!< RTC time stamp date register,                             Address offset: 0x34 */
  volatile uint32_t TSSSR;   /*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
  volatile uint32_t CALR;    /*!< RTC calibration register,                                 Address offset: 0x3C */
  volatile uint32_t TAFCR;   /*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
  volatile uint32_t ALRMASSR;/*!< RTC alarm A sub second register,                          Address offset: 0x44 */
  volatile uint32_t ALRMBSSR;/*!< RTC alarm B sub second register,                          Address offset: 0x48 */
  uint32_t RESERVED7;    /*!< Reserved, 0x4C                                                                 */
  volatile uint32_t BKP0R;   /*!< RTC backup register 1,                                    Address offset: 0x50 */
  volatile uint32_t BKP1R;   /*!< RTC backup register 1,                                    Address offset: 0x54 */
  volatile uint32_t BKP2R;   /*!< RTC backup register 2,                                    Address offset: 0x58 */
  volatile uint32_t BKP3R;   /*!< RTC backup register 3,                                    Address offset: 0x5C */
  volatile uint32_t BKP4R;   /*!< RTC backup register 4,                                    Address offset: 0x60 */
  volatile uint32_t BKP5R;   /*!< RTC backup register 5,                                    Address offset: 0x64 */
  volatile uint32_t BKP6R;   /*!< RTC backup register 6,                                    Address offset: 0x68 */
  volatile uint32_t BKP7R;   /*!< RTC backup register 7,                                    Address offset: 0x6C */
  volatile uint32_t BKP8R;   /*!< RTC backup register 8,                                    Address offset: 0x70 */
  volatile uint32_t BKP9R;   /*!< RTC backup register 9,                                    Address offset: 0x74 */
  volatile uint32_t BKP10R;  /*!< RTC backup register 10,                                   Address offset: 0x78 */
  volatile uint32_t BKP11R;  /*!< RTC backup register 11,                                   Address offset: 0x7C */
  volatile uint32_t BKP12R;  /*!< RTC backup register 12,                                   Address offset: 0x80 */
  volatile uint32_t BKP13R;  /*!< RTC backup register 13,                                   Address offset: 0x84 */
  volatile uint32_t BKP14R;  /*!< RTC backup register 14,                                   Address offset: 0x88 */
  volatile uint32_t BKP15R;  /*!< RTC backup register 15,                                   Address offset: 0x8C */
  volatile uint32_t BKP16R;  /*!< RTC backup register 16,                                   Address offset: 0x90 */
  volatile uint32_t BKP17R;  /*!< RTC backup register 17,                                   Address offset: 0x94 */
  volatile uint32_t BKP18R;  /*!< RTC backup register 18,                                   Address offset: 0x98 */
  volatile uint32_t BKP19R;  /*!< RTC backup register 19,                                   Address offset: 0x9C */
} RTC_TypeDef;
	 
#define RTC                 ((RTC_TypeDef *) RTC_BASE)	 

/** 
  *  SD host Interface
  */

typedef struct
{
  volatile uint32_t POWER;                 /*!< SDIO power control register,    Address offset: 0x00 */
  volatile uint32_t CLKCR;                 /*!< SDI clock control register,     Address offset: 0x04 */
  volatile uint32_t ARG;                   /*!< SDIO argument register,         Address offset: 0x08 */
  volatile uint32_t CMD;                   /*!< SDIO command register,          Address offset: 0x0C */
  volatile const uint32_t  RESPCMD;        /*!< SDIO command response register, Address offset: 0x10 */
  volatile const uint32_t  RESP1;          /*!< SDIO response 1 register,       Address offset: 0x14 */
  volatile const uint32_t  RESP2;          /*!< SDIO response 2 register,       Address offset: 0x18 */
  volatile const uint32_t  RESP3;          /*!< SDIO response 3 register,       Address offset: 0x1C */
  volatile const uint32_t  RESP4;          /*!< SDIO response 4 register,       Address offset: 0x20 */
  volatile uint32_t DTIMER;                /*!< SDIO data timer register,       Address offset: 0x24 */
  volatile uint32_t DLEN;                  /*!< SDIO data length register,      Address offset: 0x28 */
  volatile uint32_t DCTRL;                 /*!< SDIO data control register,     Address offset: 0x2C */
  volatile const uint32_t  DCOUNT;         /*!< SDIO data counter register,     Address offset: 0x30 */
  volatile const uint32_t  STA;            /*!< SDIO status register,           Address offset: 0x34 */
  volatile uint32_t ICR;                   /*!< SDIO interrupt clear register,  Address offset: 0x38 */
  volatile uint32_t MASK;                  /*!< SDIO mask register,             Address offset: 0x3C */
  uint32_t      RESERVED0[2];          /*!< Reserved, 0x40-0x44                                  */
  volatile const uint32_t  FIFOCNT;        /*!< SDIO FIFO counter register,     Address offset: 0x48 */
  uint32_t      RESERVED1[13];         /*!< Reserved, 0x4C-0x7C                                  */
  volatile uint32_t FIFO;                  /*!< SDIO data FIFO register,        Address offset: 0x80 */
} SDIO_TypeDef;
	 
#define SDIO                ((SDIO_TypeDef *) SDIO_BASE)	 

/** 
  *  Serial Peripheral Interface
  */

typedef struct
{
  volatile uint32_t CR1;        /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  volatile uint32_t CR2;        /*!< SPI control register 2,                             Address offset: 0x04 */
  volatile uint32_t SR;         /*!< SPI status register,                                Address offset: 0x08 */
  volatile uint32_t DR;         /*!< SPI data register,                                  Address offset: 0x0C */
  volatile uint32_t CRCPR;      /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  volatile uint32_t RXCRCR;     /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  volatile uint32_t TXCRCR;     /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  volatile uint32_t I2SCFGR;    /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  volatile uint32_t I2SPR;      /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
} SPI_TypeDef;
	 

#define SPI1                ((SPI_TypeDef *) SPI1_BASE)	 
#define SPI2                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                ((SPI_TypeDef *) SPI3_BASE)
#define SPI4                ((SPI_TypeDef *) SPI4_BASE)
#define SPI5                ((SPI_TypeDef *) SPI5_BASE)	 
#define I2S2ext             ((SPI_TypeDef *) I2S2ext_BASE)	 
#define I2S3ext             ((SPI_TypeDef *) I2S3ext_BASE)	 



/** 
  *  TIM
  */

typedef struct
{
  volatile uint32_t CR1;         /*!< TIM control register 1,              Address offset: 0x00 */
  volatile uint32_t CR2;         /*!< TIM control register 2,              Address offset: 0x04 */
  volatile uint32_t SMCR;        /*!< TIM slave mode control register,     Address offset: 0x08 */
  volatile uint32_t DIER;        /*!< TIM DMA/interrupt enable register,   Address offset: 0x0C */
  volatile uint32_t SR;          /*!< TIM status register,                 Address offset: 0x10 */
  volatile uint32_t EGR;         /*!< TIM event generation register,       Address offset: 0x14 */
  volatile uint32_t CCMR1;       /*!< TIM capture/compare mode register 1, Address offset: 0x18 */
  volatile uint32_t CCMR2;       /*!< TIM capture/compare mode register 2, Address offset: 0x1C */
  volatile uint32_t CCER;        /*!< TIM capture/compare enable register, Address offset: 0x20 */
  volatile uint32_t CNT;         /*!< TIM counter register,                Address offset: 0x24 */
  volatile uint32_t PSC;         /*!< TIM prescaler,                       Address offset: 0x28 */
  volatile uint32_t ARR;         /*!< TIM auto-reload register,            Address offset: 0x2C */
  volatile uint32_t RCR;         /*!< TIM repetition counter register,     Address offset: 0x30 */
  volatile uint32_t CCR1;        /*!< TIM capture/compare register 1,      Address offset: 0x34 */
  volatile uint32_t CCR2;        /*!< TIM capture/compare register 2,      Address offset: 0x38 */
  volatile uint32_t CCR3;        /*!< TIM capture/compare register 3,      Address offset: 0x3C */
  volatile uint32_t CCR4;        /*!< TIM capture/compare register 4,      Address offset: 0x40 */
  volatile uint32_t BDTR;        /*!< TIM break and dead-time register,    Address offset: 0x44 */
  volatile uint32_t DCR;         /*!< TIM DMA control register,            Address offset: 0x48 */
  volatile uint32_t DMAR;        /*!< TIM DMA address for full transfer,   Address offset: 0x4C */
  volatile uint32_t OR;          /*!< TIM option register,                 Address offset: 0x50 */
} TIM_TypeDef;

